MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA0L1073CFL/mcu.h
/* ======================================================  CTSUSUCLK3  ======================================================= */
/* ======================================================  CTSUCFCCNT  ======================================================= */
 #define R_CTSU2_CTSUCFCCNT_CFCCNT_Pos          (0UL)          /*!< CFCCNT (Bit 0)                                        */
 #define R_CTSU2_CTSUCFCCNT_CFCCNT_Msk          (0xffffUL)     /*!< CFCCNT (Bitfield-Mask: 0xffff)                        */
/* ======================================================  CTSUCFCCNTL  ====================================================== */
/* ========================================================  CTSUOPT  ======================================================== */
 #define R_CTSU2_CTSUOPT_CCOCFEN_Pos            (0UL)          /*!< CCOCFEN (Bit 0)                                       */
 #define R_CTSU2_CTSUOPT_CCOCFEN_Msk            (0x1UL)        /*!< CCOCFEN (Bitfield-Mask: 0x01)                         */
 #define R_CTSU2_CTSUOPT_MCACEFN_Pos            (1UL)          /*!< MCACEFN (Bit 1)                                       */
 #define R_CTSU2_CTSUOPT_MCACEFN_Msk            (0x2UL)        /*!< MCACEFN (Bitfield-Mask: 0x01)                         */
 #define R_CTSU2_CTSUOPT_MAJIRIMD_Pos           (2UL)          /*!< MAJIRIMD (Bit 2)                                      */
 #define R_CTSU2_CTSUOPT_MAJIRIMD_Msk           (0x4UL)        /*!< MAJIRIMD (Bitfield-Mask: 0x01)                        */
 #define R_CTSU2_CTSUOPT_DTCLESS_Pos            (4UL)          /*!< DTCLESS (Bit 4)                                       */
 #define R_CTSU2_CTSUOPT_DTCLESS_Msk            (0x10UL)       /*!< DTCLESS (Bitfield-Mask: 0x01)                         */
 #define R_CTSU2_CTSUOPT_MTUCFEN_Pos            (5UL)          /*!< MTUCFEN (Bit 5)                                       */
 #define R_CTSU2_CTSUOPT_MTUCFEN_Msk            (0x20UL)       /*!< MTUCFEN (Bitfield-Mask: 0x01)                         */
 #define R_CTSU2_CTSUOPT_AJFEN_Pos              (8UL)          /*!< AJFEN (Bit 8)                                         */
 #define R_CTSU2_CTSUOPT_AJFEN_Msk              (0x100UL)      /*!< AJFEN (Bitfield-Mask: 0x01)                           */
 #define R_CTSU2_CTSUOPT_AJINTC_Pos             (9UL)          /*!< AJINTC (Bit 9)                                        */
 #define R_CTSU2_CTSUOPT_AJINTC_Msk             (0x200UL)      /*!< AJINTC (Bitfield-Mask: 0x01)                          */
 #define R_CTSU2_CTSUOPT_SCACTB_Pos             (16UL)         /*!< SCACTB (Bit 16)                                       */
 #define R_CTSU2_CTSUOPT_SCACTB_Msk             (0xf0000UL)    /*!< SCACTB (Bitfield-Mask: 0x0f)                          */
/* =======================================================  CTSUOPTL  ======================================================== */
/* ==========================================================  AC  =========================================================== */
 #define R_CTSU2_AC_CCOCFEN_Pos                 (0UL)          /*!< CCOCFEN (Bit 0)                                       */
 #define R_CTSU2_AC_CCOCFEN_Msk                 (0x1UL)        /*!< CCOCFEN (Bitfield-Mask: 0x01)                         */
 #define R_CTSU2_AC_MCACEFN_Pos                 (1UL)          /*!< MCACEFN (Bit 1)                                       */
 #define R_CTSU2_AC_MCACEFN_Msk                 (0x2UL)        /*!< MCACEFN (Bitfield-Mask: 0x01)                         */
 #define R_CTSU2_AC_MAJIRIMD_Pos                (2UL)          /*!< MAJIRIMD (Bit 2)                                      */
 #define R_CTSU2_AC_MAJIRIMD_Msk                (0x4UL)        /*!< MAJIRIMD (Bitfield-Mask: 0x01)                        */
 #define R_CTSU2_AC_DTCLESS_Pos                 (4UL)          /*!< DTCLESS (Bit 4)                                       */
 #define R_CTSU2_AC_DTCLESS_Msk                 (0x10UL)       /*!< DTCLESS (Bitfield-Mask: 0x01)                         */
 #define R_CTSU2_AC_MTUCFEN_Pos                 (5UL)          /*!< MTUCFEN (Bit 5)                                       */
 #define R_CTSU2_AC_MTUCFEN_Msk                 (0x20UL)       /*!< MTUCFEN (Bitfield-Mask: 0x01)                         */
/* ==========================================================  AJ  =========================================================== */
 #define R_CTSU2_AJ_AJFEN_Pos                   (0UL)          /*!< AJFEN (Bit 0)                                         */
 #define R_CTSU2_AJ_AJFEN_Msk                   (0x1UL)        /*!< AJFEN (Bitfield-Mask: 0x01)                           */
 #define R_CTSU2_AJ_AJINTC_Pos                  (1UL)          /*!< AJINTC (Bit 1)                                        */
 #define R_CTSU2_AJ_AJINTC_Msk                  (0x2UL)        /*!< AJINTC (Bitfield-Mask: 0x01)                          */
/* =======================================================  CTSUOPTH  ======================================================== */
/* =========================================================  ACTB  ========================================================== */
 #define R_CTSU2_ACTB_SCACTB_Pos                (0UL)          /*!< SCACTB (Bit 0)                                        */
 #define R_CTSU2_ACTB_SCACTB_Msk                (0xfUL)        /*!< SCACTB (Bitfield-Mask: 0x0f)                          */
/* ======================================================  CTSUSCNTACT  ====================================================== */
 #define R_CTSU2_CTSUSCNTACT_SCNTACCOEFF_Pos    (0UL)          /*!< SCNTACCOEFF (Bit 0)                                   */
 #define R_CTSU2_CTSUSCNTACT_SCNTACCOEFF_Msk    (0xffffUL)     /*!< SCNTACCOEFF (Bitfield-Mask: 0xffff)                   */
 #define R_CTSU2_CTSUSCNTACT_SCNTACCOUNT_Pos    (16UL)         /*!< SCNTACCOUNT (Bit 16)                                  */
 #define R_CTSU2_CTSUSCNTACT_SCNTACCOUNT_Msk    (0xffff0000UL) /*!< SCNTACCOUNT (Bitfield-Mask: 0xffff)                   */
/* =====================================================  CTSUSCNTACTL  ====================================================== */
/* =====================================================  CTSUSCNTACTH  ====================================================== */
/* =======================================================  CTSUMACT1  ======================================================= */
 #define R_CTSU2_CTSUMACT1_SO_Pos               (0UL)          /*!< SO (Bit 0)                                            */
 #define R_CTSU2_CTSUMACT1_SO_Msk               (0x3ffUL)      /*!< SO (Bitfield-Mask: 0x3ff)                             */
 #define R_CTSU2_CTSUMACT1_OFFSETCOEFF_Pos      (16UL)         /*!< OFFSETCOEFF (Bit 16)                                  */
 #define R_CTSU2_CTSUMACT1_OFFSETCOEFF_Msk      (0xffff0000UL) /*!< OFFSETCOEFF (Bitfield-Mask: 0xffff)                   */
/* ======================================================  CTSUMACT1L  ======================================================= */
/* ======================================================  CTSUMACT1H  ======================================================= */
/* =======================================================  CTSUMACT2  ======================================================= */
 #define R_CTSU2_CTSUMACT2_SO_Pos               (0UL)          /*!< SO (Bit 0)                                            */
 #define R_CTSU2_CTSUMACT2_SO_Msk               (0x3ffUL)      /*!< SO (Bitfield-Mask: 0x3ff)                             */
 #define R_CTSU2_CTSUMACT2_OFFSETCOEFF_Pos      (16UL)         /*!< OFFSETCOEFF (Bit 16)                                  */
 #define R_CTSU2_CTSUMACT2_OFFSETCOEFF_Msk      (0xffff0000UL) /*!< OFFSETCOEFF (Bitfield-Mask: 0xffff)                   */
/* ======================================================  CTSUMACT2L  ======================================================= */
/* ======================================================  CTSUMACT2H  ======================================================= */
/* =======================================================  CTSUMACT3  ======================================================= */
 #define R_CTSU2_CTSUMACT3_SO_Pos               (0UL)          /*!< SO (Bit 0)                                            */
 #define R_CTSU2_CTSUMACT3_SO_Msk               (0x3ffUL)      /*!< SO (Bitfield-Mask: 0x3ff)                             */
 #define R_CTSU2_CTSUMACT3_OFFSETCOEFF_Pos      (16UL)         /*!< OFFSETCOEFF (Bit 16)                                  */
 #define R_CTSU2_CTSUMACT3_OFFSETCOEFF_Msk      (0xffff0000UL) /*!< OFFSETCOEFF (Bitfield-Mask: 0xffff)                   */
/* ======================================================  CTSUMACT3L  ======================================================= */
/* ======================================================  CTSUMACT3H  ======================================================= */
/* =======================================================  CTSUAJCR  ======================================================== */
 #define R_CTSU2_CTSUAJCR_TLOT_Pos              (0UL)          /*!< TLOT (Bit 0)                                          */
 #define R_CTSU2_CTSUAJCR_TLOT_Msk              (0xffUL)       /*!< TLOT (Bitfield-Mask: 0xff)                            */
 #define R_CTSU2_CTSUAJCR_THOT_Pos              (8UL)          /*!< THOT (Bit 8)                                          */
 #define R_CTSU2_CTSUAJCR_THOT_Msk              (0xff00UL)     /*!< THOT (Bitfield-Mask: 0xff)                            */
 #define R_CTSU2_CTSUAJCR_BLINI_Pos             (16UL)         /*!< BLINI (Bit 16)                                        */
 #define R_CTSU2_CTSUAJCR_BLINI_Msk             (0x10000UL)    /*!< BLINI (Bitfield-Mask: 0x01)                           */
 #define R_CTSU2_CTSUAJCR_JC_Pos                (20UL)         /*!< JC (Bit 20)                                           */
 #define R_CTSU2_CTSUAJCR_JC_Msk                (0x300000UL)   /*!< JC (Bitfield-Mask: 0x03)                              */
 #define R_CTSU2_CTSUAJCR_AJMMAT_Pos            (24UL)         /*!< AJMMAT (Bit 24)                                       */
 #define R_CTSU2_CTSUAJCR_AJMMAT_Msk            (0xf000000UL)  /*!< AJMMAT (Bitfield-Mask: 0x0f)                          */
 #define R_CTSU2_CTSUAJCR_AJBMAT_Pos            (28UL)         /*!< AJBMAT (Bit 28)                                       */
 #define R_CTSU2_CTSUAJCR_AJBMAT_Msk            (0xf0000000UL) /*!< AJBMAT (Bitfield-Mask: 0x0f)                          */
/* =======================================================  CTSUAJCRL  ======================================================= */
/* =========================================================  AJCR0  ========================================================= */
 #define R_CTSU2_AJCR0_TLOT_Pos                 (0UL)          /*!< TLOT (Bit 0)                                          */
 #define R_CTSU2_AJCR0_TLOT_Msk                 (0xffUL)       /*!< TLOT (Bitfield-Mask: 0xff)                            */
/* =========================================================  AJCR1  ========================================================= */
 #define R_CTSU2_AJCR1_THOT_Pos                 (0UL)          /*!< THOT (Bit 0)                                          */
 #define R_CTSU2_AJCR1_THOT_Msk                 (0xffUL)       /*!< THOT (Bitfield-Mask: 0xff)                            */
/* =======================================================  CTSUAJCRH  ======================================================= */
/* =========================================================  AJCR2  ========================================================= */
 #define R_CTSU2_AJCR2_BLINI_Pos                (0UL)          /*!< BLINI (Bit 0)                                         */
 #define R_CTSU2_AJCR2_BLINI_Msk                (0x1UL)        /*!< BLINI (Bitfield-Mask: 0x01)                           */
 #define R_CTSU2_AJCR2_JC_Pos                   (4UL)          /*!< JC (Bit 4)                                            */
 #define R_CTSU2_AJCR2_JC_Msk                   (0x30UL)       /*!< JC (Bitfield-Mask: 0x03)                              */
/* =========================================================  AJCR3  ========================================================= */
 #define R_CTSU2_AJCR3_AJMMAT_Pos               (0UL)          /*!< AJMMAT (Bit 0)                                        */
 #define R_CTSU2_AJCR3_AJMMAT_Msk               (0xfUL)        /*!< AJMMAT (Bitfield-Mask: 0x0f)                          */
 #define R_CTSU2_AJCR3_AJBMAT_Pos               (4UL)          /*!< AJBMAT (Bit 4)                                        */
 #define R_CTSU2_AJCR3_AJBMAT_Msk               (0xf0UL)       /*!< AJBMAT (Bitfield-Mask: 0x0f)                          */
/* =======================================================  CTSUAJTHR  ======================================================= */
 #define R_CTSU2_CTSUAJTHR_AJTHL_Pos            (0UL)          /*!< AJTHL (Bit 0)                                         */
 #define R_CTSU2_CTSUAJTHR_AJTHL_Msk            (0xffffUL)     /*!< AJTHL (Bitfield-Mask: 0xffff)                         */
 #define R_CTSU2_CTSUAJTHR_AJTHH_Pos            (16UL)         /*!< AJTHH (Bit 16)                                        */
 #define R_CTSU2_CTSUAJTHR_AJTHH_Msk            (0xffff0000UL) /*!< AJTHH (Bitfield-Mask: 0xffff)                         */
/* ======================================================  CTSUAJTHRL  ======================================================= */
/* ======================================================  CTSUAJTHRH  ======================================================= */
/* ======================================================  CTSUAJMMAR  ======================================================= */
 #define R_CTSU2_CTSUAJMMAR_AJMMATI_Pos         (0UL)          /*!< AJMMATI (Bit 0)                                       */
 #define R_CTSU2_CTSUAJMMAR_AJMMATI_Msk         (0xfUL)        /*!< AJMMATI (Bitfield-Mask: 0x0f)                         */
 #define R_CTSU2_CTSUAJMMAR_AJMMR_Pos           (5UL)          /*!< AJMMR (Bit 5)                                         */
 #define R_CTSU2_CTSUAJMMAR_AJMMR_Msk           (0xffffffe0UL) /*!< AJMMR (Bitfield-Mask: 0x7ffffff)                      */
/* ======================================================  CTSUAJMMARL  ====================================================== */
/* ======================================================  CTSUAJMMARH  ====================================================== */
/* ======================================================  CTSUAJBLACT  ====================================================== */
 #define R_CTSU2_CTSUAJBLACT_AJBLACT_Pos        (0UL)          /*!< AJBLACT (Bit 0)                                       */
 #define R_CTSU2_CTSUAJBLACT_AJBLACT_Msk        (0xffffffffUL) /*!< AJBLACT (Bitfield-Mask: 0xffffffff)                   */
/* =====================================================  CTSUAJBLACTL  ====================================================== */
/* =====================================================  CTSUAJBLACTH  ====================================================== */
/* ======================================================  CTSUAJBLAR  ======================================================= */
 #define R_CTSU2_CTSUAJBLAR_AJBLAC_Pos          (0UL)          /*!< AJBLAC (Bit 0)                                        */
 #define R_CTSU2_CTSUAJBLAR_AJBLAC_Msk          (0xffffUL)     /*!< AJBLAC (Bitfield-Mask: 0xffff)                        */
 #define R_CTSU2_CTSUAJBLAR_AJBLAR_Pos          (16UL)         /*!< AJBLAR (Bit 16)                                       */
 #define R_CTSU2_CTSUAJBLAR_AJBLAR_Msk          (0xffff0000UL) /*!< AJBLAR (Bitfield-Mask: 0xffff)                        */
/* ======================================================  CTSUAJBLARL  ====================================================== */
/* ======================================================  CTSUAJBLARH  ====================================================== */
/* =======================================================  CTSUAJRR  ======================================================== */
 #define R_CTSU2_CTSUAJRR_TJR0_Pos              (0UL)          /*!< TJR0 (Bit 0)                                          */
 #define R_CTSU2_CTSUAJRR_TJR0_Msk              (0x1UL)        /*!< TJR0 (Bitfield-Mask: 0x01)                            */
 #define R_CTSU2_CTSUAJRR_TJR1_Pos              (1UL)          /*!< TJR1 (Bit 1)                                          */
 #define R_CTSU2_CTSUAJRR_TJR1_Msk              (0x2UL)        /*!< TJR1 (Bitfield-Mask: 0x01)                            */
 #define R_CTSU2_CTSUAJRR_TJR2_Pos              (2UL)          /*!< TJR2 (Bit 2)                                          */
 #define R_CTSU2_CTSUAJRR_TJR2_Msk              (0x4UL)        /*!< TJR2 (Bitfield-Mask: 0x01)                            */
 #define R_CTSU2_CTSUAJRR_TJR3_Pos              (3UL)          /*!< TJR3 (Bit 3)                                          */
 #define R_CTSU2_CTSUAJRR_TJR3_Msk              (0x8UL)        /*!< TJR3 (Bitfield-Mask: 0x01)                            */
 #define R_CTSU2_CTSUAJRR_FJR_Pos               (4UL)          /*!< FJR (Bit 4)                                           */
 #define R_CTSU2_CTSUAJRR_FJR_Msk               (0x10UL)       /*!< FJR (Bitfield-Mask: 0x01)                             */
 #define R_CTSU2_CTSUAJRR_SJCCR_Pos             (8UL)          /*!< SJCCR (Bit 8)                                         */
 #define R_CTSU2_CTSUAJRR_SJCCR_Msk             (0xff00UL)     /*!< SJCCR (Bitfield-Mask: 0xff)                           */
/* =======================================================  CTSUAJRRL  ======================================================= */
/* =======================================================  CTSUAJRR0  ======================================================= */
/* =======================================================  CTSUAJRR1  ======================================================= */
/* ========================================================  CTSUUC  ========================================================= */
 #define R_CTSU2_CTSUUC_SENSCNT_Pos             (0UL)      /*!< SENSCNT (Bit 0)                                       */
 #define R_CTSU2_CTSUUC_SENSCNT_Msk             (0xffffUL) /*!< SENSCNT (Bitfield-Mask: 0xffff)                       */

/* =========================================================================================================================== */
/* ================                                          R_DEBUG                                          ================ */
/* =========================================================================================================================== */

